### Importando Bibliotecas

In [148]:
import pandas as pd
import numpy as np
import seaborn as sns

In [163]:
df = pd.read_csv('historical-database.csv', sep = ';')

In [170]:
df

             year         city_code product_type product  destinated_area
0      01/01/1974  960b4f2c94a2fb2c   temporario  Outros             0.00
1      01/01/1974  746cc42bfb8f6b62   temporario  Outros             0.00
2      01/01/1974  6cce2bf873870afc   temporario  Outros             0.00
3      01/01/1974  4de42e351006a2ae   temporario  Outros             0.00
4      01/01/1974  5b6072f8f6d37acc   temporario  Outros             0.00
...           ...               ...          ...     ...              ...
73739  01/01/2013  74d75dde6dc4a5ec        pasto    Gado        150866.56
73740  01/01/2014  74d75dde6dc4a5ec        pasto    Gado        152446.40
73741  01/01/2015  74d75dde6dc4a5ec        pasto    Gado        154681.02
73742  01/01/2016  74d75dde6dc4a5ec        pasto    Gado        164706.28
73743  01/01/2017  74d75dde6dc4a5ec        pasto    Gado        165220.87

[34709 rows x 5 columns]

### Outliers

Existem 39035 valores com vírgulas desnecessários para os cálculos

In [165]:
#df['destinated_area'].value_counts()
lista_virgulas = list(df[df.destinated_area==","].index)
df[df.destinated_area==","]

             year         city_code product_type   product destinated_area
6292   01/01/1974  960b4f2c94a2fb2c    temporary      Rice               ,
6293   01/01/1974  960b4f2c94a2fb2c    temporary     Beans               ,
6294   01/01/1974  960b4f2c94a2fb2c    temporary   Cassava               ,
6295   01/01/1974  960b4f2c94a2fb2c    temporary      Corn               ,
6296   01/01/1974  960b4f2c94a2fb2c    temporary       Soy               ,
...           ...               ...          ...       ...             ...
68983  01/01/2001  1bd7145ed1da044a    permanent  Palm oil               ,
68988  01/01/2001  f1fd357c5adaa8dc    permanent  Palm oil               ,
68989  01/01/2001  8a4ab531676691da    permanent  Palm oil               ,
68990  01/01/2001  c45d8ddba643c0d7    permanent      Açaí               ,
68991  01/01/2001  c45d8ddba643c0d7    permanent     Cocoa               ,

[39035 rows x 5 columns]

In [166]:
# removendo valores com ,
df = df.drop(lista_virgulas)
# trocando virgula por ponto
df['destinated_area'] = df['destinated_area'].apply(lambda x: float(x.split()[0].replace(',', '.')))
df

             year         city_code product_type    product  destinated_area
0      01/01/1974  960b4f2c94a2fb2c    temporary     Others             0.00
1      01/01/1974  746cc42bfb8f6b62    temporary     Others             0.00
2      01/01/1974  6cce2bf873870afc    temporary     Others             0.00
3      01/01/1974  4de42e351006a2ae    temporary     Others             0.00
4      01/01/1974  5b6072f8f6d37acc    temporary     Others             0.00
...           ...               ...          ...        ...              ...
73739  01/01/2013  74d75dde6dc4a5ec      pasture  Livestock        150866.56
73740  01/01/2014  74d75dde6dc4a5ec      pasture  Livestock        152446.40
73741  01/01/2015  74d75dde6dc4a5ec      pasture  Livestock        154681.02
73742  01/01/2016  74d75dde6dc4a5ec      pasture  Livestock        164706.28
73743  01/01/2017  74d75dde6dc4a5ec      pasture  Livestock        165220.87

[34709 rows x 5 columns]

In [153]:
# list(pd.DataFrame(df['city_code'].value_counts()).index)

### Traduzindo os itens para uma melhor compreensão

In [167]:
df['product'] = df['product'].map({'Others':'Outros',
                                   'Cassava':'Mandioca',
                                   'Cocoa':'Cacau',
                                   'Beans':'Feijões',
                                   'Açaí':'Açaí',
                                   'Corn':'Milho',
                                   'Rice':'Arroz',
                                   'Palm oil':'Azeite de dendê',
                                   'Sorghum':'Sorgo',
                                   'Soy':'Soja',
                                   'Livestock':'Gado',
                                   np.nan:'NY'},
                                   na_action=None)
df['product_type'] = df['product_type'].map({'temporary':'temporario',
                                             'permanent':'permanente',
                                             'pasture':'pasto',
                                             np.nan:'NY'},
                                             na_action=None)
df['destinated_area'] = df['destinated_area'].astype('float')

In [168]:
df

             year         city_code product_type product  destinated_area
0      01/01/1974  960b4f2c94a2fb2c   temporario  Outros             0.00
1      01/01/1974  746cc42bfb8f6b62   temporario  Outros             0.00
2      01/01/1974  6cce2bf873870afc   temporario  Outros             0.00
3      01/01/1974  4de42e351006a2ae   temporario  Outros             0.00
4      01/01/1974  5b6072f8f6d37acc   temporario  Outros             0.00
...           ...               ...          ...     ...              ...
73739  01/01/2013  74d75dde6dc4a5ec        pasto    Gado        150866.56
73740  01/01/2014  74d75dde6dc4a5ec        pasto    Gado        152446.40
73741  01/01/2015  74d75dde6dc4a5ec        pasto    Gado        154681.02
73742  01/01/2016  74d75dde6dc4a5ec        pasto    Gado        164706.28
73743  01/01/2017  74d75dde6dc4a5ec        pasto    Gado        165220.87

[34709 rows x 5 columns]

In [ ]:
# vendo se dá